ka2_2024/src/InformationRegisters/СвязиПоказателейБюджетов/СвязиПоказателейБюджетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СвязиПоказателейБюджетов</name>
  <resources>
    <name>Расход</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Аналитика1</name>
    <type>
      <types>Characteristic.АналитикиСтатейБюджетов</types>
    </type>
  </resources>
  <resources>
    <name>Аналитика2</name>
    <type>
      <types>Characteristic.АналитикиСтатейБюджетов</types>
    </type>
  </resources>
  <resources>
    <name>Аналитика3</name>
    <type>
      <types>Characteristic.АналитикиСтатейБюджетов</types>
    </type>
  </resources>
  <resources>
    <name>Аналитика4</name>
    <type>
      <types>Characteristic.АналитикиСтатейБюджетов</types>
    </type>
  </resources>
  <resources>
    <name>Аналитика5</name>
    <type>
      <types>Characteristic.АналитикиСтатейБюджетов</types>
    </type>
  </resources>
  <resources>
    <name>Аналитика6</name>
    <type>
      <types>Characteristic.АналитикиСтатейБюджетов</types>
    </type>
  </resources>
  <resources>
    <name>ТранслироватьАналитику1</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТранслироватьАналитику2</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТранслироватьАналитику3</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТранслироватьАналитику4</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТранслироватьАналитику5</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТранслироватьАналитику6</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Коэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>АдресТрансляцииАналитики1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>АдресТрансляцииАналитики2</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>АдресТрансляцииАналитики3</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>АдресТрансляцииАналитики4</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>АдресТрансляцииАналитики5</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>АдресТрансляцииАналитики6</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>СтатьяБюджетов</name>
    <type>
      <types>CatalogRef.СтатьиБюджетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СвязанныйПоказательБюджетов</name>
    <type>
      <types>CatalogRef.ПоказателиБюджетов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ka2_2024/src/InformationRegisters/СвязиПоказателейБюджетов/Forms/ФормаСпискаКонтекстПоказательБюджетов/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	ПоказательБюджетов = Параметры.ПоказательБюджетов;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ПоказательБюджетов", ПоказательБюджетов);
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		Список, "ТекстТранслируется", НСтр("ru = 'транслируется'"));
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		Список, "ТекстПрочие", НСтр("ru = 'Прочие'"));
		
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		Список, "Приход", НСтр("ru = 'Приход'"));
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		Список, "Расход", НСтр("ru = 'Расход'"));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыСписок

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("СвязанныйПоказательБюджетов", ПоказательБюджетов);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	ПараметрыФормы.Вставить("КонтекстСвязанныйПоказательБюджетов", Истина);

	ОткрытьФорму("РегистрСведений.СвязиПоказателейБюджетов.Форма.ФормаЗаписи", 
		ПараметрыФормы,
		ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФормуЗаписи();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	ОткрытьФормуЗаписи();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОткрытьФормуЗаписи()
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", Элементы.Список.ТекущаяСтрока);
	ПараметрыФормы.Вставить("КонтекстСвязанныйПоказательБюджетов", Истина);
	
	ОткрытьФорму("РегистрСведений.СвязиПоказателейБюджетов.Форма.ФормаЗаписи",
		ПараметрыФормы,
		ЭтаФорма);
	
КонецПроцедуры
	
#КонецОбласти
